In [4]:
# imports numpy and pandas
import pandas as pd
import numpy as np

In [5]:
# Data Path
Data = 'C:/Users/patel/lighthouse-lab-allprojects/Mid-Project-Data/fuel_consumption.csv'

In [6]:
df = pd.read_csv(Data, low_memory=False)

In [7]:
df.head()

,month,airline_id,unique_carrier,carrier,carrier_name,carrier_group_new,sdomt_gallons,satl_gallons,spac_gallons,slat_gallons,...,sdomt_cost,satl_cost,spac_cost,slat_cost,sint_cost,ts_cost,tdomt_cost,tint_cost,total_cost,year
0,1,NaN,NaN,0JQ,NaN,1,0.0,0.0,0.0,0.0,...,0,0.0,0.0,0.0,0.0,0,5100,0.0,5100,2016
1,1,21352.0,0WQ,0WQ,Avjet Corporation,1,0.0,0.0,0.0,0.0,...,0,0.0,0.0,0.0,0.0,0,396216,140239.0,536455,2016
2,1,21645.0,23Q,23Q,Songbird Airways Inc.,1,0.0,0.0,0.0,0.0,...,0,0.0,0.0,0.0,0.0,0,0,0.0,0,2016
3,1,21652.0,27Q,27Q,"Jet Aviation Flight Services, Inc.",1,0.0,0.0,0.0,0.0,...,0,0.0,0.0,0.0,0.0,0,0,0.0,0,2016
4,1,20408.0,5V,5V,Tatonduk Outfitters Limited d/b/a Everts Air A...,1,260848.0,0.0,0.0,0.0,...,522405,0.0,0.0,0.0,0.0,522405,569497,0.0,569497,2016

In [8]:
# 2. Basic data exploration
# 2.1 Dimensions of the dataset
print('The dimensions of the dataset are:', df.shape)

The dimensions of the dataset are: (3035, 25)

In [9]:
# 2.2 Data type of each attribute
print('The data type of each attribute is:', df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3035 entries, 0 to 3034
Data columns (total 25 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   month              3035 non-null   int64
 1   airline_id         3034 non-null   float64
 2   unique_carrier     3034 non-null   object
 3   carrier            3035 non-null   object
 4   carrier_name       3034 non-null   object
 5   carrier_group_new  3035 non-null   int64
 6   sdomt_gallons      3034 non-null   float64
 7   satl_gallons       3034 non-null   float64
 8   spac_gallons       3034 non-null   float64
 9   slat_gallons       3033 non-null   float64
 10  sint_gallons       3034 non-null   float64
 11  ts_gallons         3034 non-null   float64
 12  tdomt_gallons      3032 non-null   float64
 13  tint_gallons       3034 non-null   float64
 14  total_gallons      3029 non-null   float64
 15  sdomt_cost         3035 non-null   int64
 16  satl_cost          3034 non-null   float64
 17  spac_cost          3034 non-null   float64
 18  slat_cost          3034 non-null   float64
 19  sint_cost          3034 non-null   float64
 20  ts_cost            3035 non-null   int64
 21  tdomt_cost         3035 non-null   int64
 22  tint_cost          3034 non-null   float64
 23  total_cost         3035 non-null   int64
 24  year               3035 non-null   int64
dtypes: float64(15), int64(7), object(3)
memory usage: 592.9+ KB
The data type of each attribute is: None

In [10]:
# Removing rows with null values
df= df.dropna()

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3025 entries, 1 to 3034
Data columns (total 25 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   month              3025 non-null   int64
 1   airline_id         3025 non-null   float64
 2   unique_carrier     3025 non-null   object
 3   carrier            3025 non-null   object
 4   carrier_name       3025 non-null   object
 5   carrier_group_new  3025 non-null   int64
 6   sdomt_gallons      3025 non-null   float64
 7   satl_gallons       3025 non-null   float64
 8   spac_gallons       3025 non-null   float64
 9   slat_gallons       3025 non-null   float64
 10  sint_gallons       3025 non-null   float64
 11  ts_gallons         3025 non-null   float64
 12  tdomt_gallons      3025 non-null   float64
 13  tint_gallons       3025 non-null   float64
 14  total_gallons      3025 non-null   float64
 15  sdomt_cost         3025 non-null   int64
 16  satl_cost          3025 non-null   float64
 17  spac_cost          3025 non-null   float64
 18  slat_cost          3025 non-null   float64
 19  sint_cost          3025 non-null   float64
 20  ts_cost            3025 non-null   int64
 21  tdomt_cost         3025 non-null   int64
 22  tint_cost          3025 non-null   float64
 23  total_cost         3025 non-null   int64
 24  year               3025 non-null   int64
dtypes: float64(15), int64(7), object(3)
memory usage: 614.5+ KB

In [12]:
df['year'].unique()

array([2016, 2017, 2015, 2019, 2018], dtype=int64)

In [13]:
# Selecting rows for the years 2018 and 2019
df = df[(df['year'] == 2018) | (df['year'] == 2019)]

In [14]:
df.columns

Index(['month', 'airline_id', 'unique_carrier', 'carrier', 'carrier_name',
       'carrier_group_new', 'sdomt_gallons', 'satl_gallons', 'spac_gallons',
       'slat_gallons', 'sint_gallons', 'ts_gallons', 'tdomt_gallons',
       'tint_gallons', 'total_gallons', 'sdomt_cost', 'satl_cost', 'spac_cost',
       'slat_cost', 'sint_cost', 'ts_cost', 'tdomt_cost', 'tint_cost',
       'total_cost', 'year'],
      dtype='object')

In [15]:
df.drop([ 'sdomt_gallons', 'satl_gallons', 'spac_gallons',
       'slat_gallons', 'sint_gallons', 'ts_gallons', 'tdomt_gallons',
       'tint_gallons', 'sdomt_cost', 'satl_cost', 'spac_cost',
       'slat_cost', 'sint_cost', 'ts_cost', 'tdomt_cost', 'tint_cost',
       ], axis=1, inplace=True)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1050 entries, 1977 to 3034
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   month              1050 non-null   int64
 1   airline_id         1050 non-null   float64
 2   unique_carrier     1050 non-null   object
 3   carrier            1050 non-null   object
 4   carrier_name       1050 non-null   object
 5   carrier_group_new  1050 non-null   int64
 6   total_gallons      1050 non-null   float64
 7   total_cost         1050 non-null   int64
 8   year               1050 non-null   int64
dtypes: float64(2), int64(4), object(3)
memory usage: 82.0+ KB

In [18]:
# Saving the DataFrame as a CSV file
df.to_csv('C:/Users/patel/lighthouse-lab-allprojects/Mid-Project-Data/fuel_consumption_clean.csv', index=False)